Repository: yiisoft/validator
Catalog: docs/po/client-side-validation.md/*/client-side-validation.md.*.po
Languages: ru

source: Client side validation
ru: Валидация на стороне клиента

source: Unlike Yii2, the package does not provide any handling of the validation rules on the client side. Likely it will be added later as another related package.
ru: В отличие от Yii2, этот пакет не обеспечивает обработку правил валидации на стороне клиента. Вероятно, это будет добавлено позже в виде другого связанного пакета.

source: However, there is a possibility to export rules' options as an array for passing to the client side using `RulesDumper` class:
ru: Однако существует возможность экспортировать параметры правил в виде массива для передачи на сторону клиента с помощью класса `RulesDumper`:

source: Multiple rules and nesting of rules are supported.
ru: Поддерживаются множественные правила и вложенность правил.

source: If a rule does not provide options, only the name is exported.
ru: Если правило не предоставляет параметров, экспортируется только имя.

source: - The option values that can't be serialized/reproduced on the client side - callables, for example, are excluded - either completely like `Callback::$callback` or partially like `$skipOnEmpty` if multiple types are supported.
ru: - Значения параметров, которые не могут быть сериализованы/воспроизведены на стороне клиента (например, вызываемые объекты), исключаются либо полностью, как `Callback::$callback`, либо частично, как `$skipOnEmpty`, если поддерживаются несколько типов.

source: Given built-in `Length` rule:
ru: Учитывая встроенное правило `Length`:

source: the output will be:
ru: на выходе получим:

source: The resulting array, serialized as JSON, can be unserialized back and applied to an implementation of your choice.
ru: Полученный массив, сериализованный как JSON, можно десериализовать обратно и применить к реализации по вашему выбору.

source: Structure of exported options
ru: Структура экспортируемых опций

source: Here are some specifics of the rules structure:
ru: Вот некоторые особенности структуры правил:

source: The indexing of rules by property names is maintained.
ru: Индексация правил по именам свойств сохраняется.

source: The first rule element is always a rule name with an integer index of `0`.
ru: Первый элемент правила всегда представляет собой имя правила с целочисленным индексом `0`.

source: The remaining rule elements are key-value pairs, where key is an option name and value is a corresponding option value.
ru: Остальные элементы правила представляют собой пары «ключ-значение», где ключ — это имя параметра, а значение — соответствующее значение параметра.

source: For complex rules, such as `Composite`, `Each` and `Nested`, the options of the child rules are located under the `rules` key.
ru: Для сложных правил, таких как `Composite`, `Each` и `Nested`, параметры дочерних правил находятся под ключом `rules`.

source: Note that the error messages have a special structure:
ru: Обратите внимание, что сообщения об ошибках имеют особую структуру:

source: It stays the same regardless of the presence of placeholders and parameters:
ru: Он остается неизменным независимо от наличия заполнителей и параметров:
