Repository: yiisoft/validator
Catalog: docs/po/built-*-rules-nested.md/*/built-*-rules-nested.md.*.po
Languages: ru

source: Using PHP attributes
ru: Использование атрибутов

source: `Nested` - validation of nested and related data
ru: `Nested` - проверка вложенных и связанных данных

source: Basic usage (one-to-one relation)
ru: Базовое использование (связь "один к одному")

source: In many cases there is a need to validate related data in addition to the current entity / model. There is a `Nested` rule for this purpose.
ru: Во многих случаях необходимо проверять связанные данные в дополнение к текущей сущности/модели. Для этой цели существует правило `Nested`.

source: The output of `$errors` will be:
ru: Вывод `$errors` будет такой:

source: In this example, an additional instance of the `Nested` rule is used for each relation. Other ways of configuration are possible, they are described below.
ru: В этом примере для каждого отношения используется дополнительный экземпляр правила `Nested`. Возможны и другие варианты настройки, описанные ниже.

source: Other representations of the error list are covered in the [Result] section.
ru: Другие представления списка ошибок рассматриваются в разделе [Результат].

source: Configuration options
ru: Параметры конфигурации

source: Dot notation
ru: Нотация "через точку"

source: Dot notation can be used as an alternative method of configuration. In this case, the above example is represented as follows:
ru: В качестве альтернативного метода конфигурирования можно использовать нотацию через точку. В этом случае приведенный выше пример будет выглядеть следующим образом:

source: It's also possible to combine both approaches:
ru: Также возможно объединить оба подхода:

source: Omitting code
ru: Пропуск кода

source: Some code can be omitted for brevity.
ru: Для краткости часть кода можно опустить.

source: Inner `Nested` instances
ru: Внутренние экземпляры `Nested`

source: Inner `Nested` instances can be omitted:
ru: Внутренние экземпляры `Nested` могут быть опущены:

source: Inner arrays for single rules
ru: Внутренние массивы для отдельных правил

source: Inner arrays for single rules can be omitted regardless of nesting level:
ru: Внутренние массивы для отдельных правил могут быть опущены независимо от уровня вложенности:

source: Advanced usage
ru: Расширенное использование

source: One-to-many and many-to-many relations
ru: Отношения "один ко многим" и "многие ко многим"

source: The example in the [Basic usage] section shows how to work with one-to-one relations only, where the `Nested` rule is sufficient for referencing relations. It can be combined with other complex rules, such as `Each`, to validate one-to-many and many-to-many relations as well:
ru: Пример в разделе [ Базовое использование] показывает, как работать только с отношениями "один к одному", где правила `Nested` достаточно для ссылки на отношения. Его можно комбинировать с другими сложными правилами, такими как `Each`, для проверки отношений "один ко многим" и "многие ко многим":

source: Let's take this line chart set as an example:
ru: Давайте возьмем в качестве примера этот набор линейных диаграмм:

source: Visual representation of it might look like this (also available at [JSFiddle]):
ru: Визуальное представление может выглядеть так (также доступно на [JSFiddle]):

source: Let's add the rules and modify the data a bit to contain invalid items:
ru: Давайте добавим правила и немного изменим данные, чтобы они содержали недопустимые элементы:

source: The contents of the errors will be:
ru: Содержание `$errors` будет следующим:

source: Using `*` shortcut
ru: Использование сокращения `*`

source: A `*` shortcut can be used to simplify `Nested` and `Each` combinations:
ru: Для упрощения комбинаций `Nested` и `Each` можно использовать сокращение `*`:

source: With additional grouping, it can also be rewritten like this:
ru: С дополнительной группировкой это можно переписать так:

source: This is less verbose, but the downside of this approach is that you can't additionally configure dynamically generated `Nested` and `Each` pairs. If you need to do this, use the explicit form of configuration (see the example provided in [Basic usage] section).
ru: Это менее многословно, но недостаток такого подхода заключается в том, что вы не можете дополнительно настроить динамически генерируемые пары `Nested` и `Each`. Если вам это необходимо, используйте явную форму конфигурации (см. пример в разделе [Базовое использование]).

source: Rules and relations can be declared via DTO with PHP attributes:
ru: Правила и отношения можно объявлять через DTO с PHP атрибутами:

source: With the data in the associative array from the previous examples, we can use the class just to fetch the rules:
ru: Имея данные в ассоциативном массиве из предыдущих примеров, мы можем использовать класс только для извлечения правил:

source: Or provide data along with rules in the same objects:
ru: Или предоставьте данные вместе с правилами в тех же объектах:

source: $chartSet = new ChartSet( charts: [ new Chart( points: [ new Point( coordinates: new Coordinates(x: -11, y: 11), rgb: [-1, 256, 0], ), new Point( coordinates: new Coordinates(x: -12, y: 12), rgb: [0, -2, 257], ), ], ), new Chart( points: [ new Point( coordinates: new Coordinates(x: -1, y: 1), rgb: [0, 0, 0], ), new Point( coordinates: new Coordinates(x: -2, y: 2), rgb: [255, 255, 255], ), ], ), new Chart( points: [ new Point( coordinates: new Coordinates(x: -13, y: 13), rgb: [-3, 258, 0], ), new Point( coordinates: new Coordinates(x: -14, y: 14), rgb: [0, -4, 259], ), ], ), ], ); $result = $validator->validate($chartSet); // Note `$rules` argument is `null` here. $errors = $result->getErrorMessagesIndexedByPath();
ru: $chartSet = new ChartSet( charts: [ new Chart( points: [ new Point( coordinates: new Coordinates(x: -11, y: 11), rgb: [-1, 256, 0], ), new Point( coordinates: new Coordinates(x: -12, y: 12), rgb: [0, -2, 257], ), ], ), new Chart( points: [ new Point( coordinates: new Coordinates(x: -1, y: 1), rgb: [0, 0, 0], ), new Point( coordinates: new Coordinates(x: -2, y: 2), rgb: [255, 255, 255], ), ], ), new Chart( points: [ new Point( coordinates: new Coordinates(x: -13, y: 13), rgb: [-3, 258, 0], ), new Point( coordinates: new Coordinates(x: -14, y: 14), rgb: [0, -4, 259], ), ], ), ], ); $result = $validator->validate($chartSet); // Обратите внимание, что аргумент `$rules` здесь равен `null`. $errors = $result->getErrorMessagesIndexedByPath();

source: - For more information about the different ways to configure rules via PHP attributes, see [Configuring rules via PHP attributes] section. - For more information about possible data / rules combinations passed for validation, refer to the [Using validator] section.
ru: - Дополнительную информацию о различных способах настройки правил с помощью атрибутов PHP см. в разделе [Настройка правил с помощью PHP атрибутов]. - Дополнительную информацию о возможных комбинациях данных/правил, передаваемых для проверки, см. в разделе [Использование валидатора].

source: Using keys containing separator / shortcut
ru: Использование ключей, содержащих разделитель/сокращение

source: If a key contains the separator (`.`), or `Each` shortcut (`*`), it must be escaped with backslash (`\`) in the rule config to work correctly. In the input data escaping is not needed. Here is an example with 2 nested keys named `author.data` and `name.surname`:
ru: Если ключ содержит разделитель (`.`) или сокращение `Each` (`*`) для корректной работы его необходимо экранировать обратной косой чертой (`\`) в конфигурации правила. Во входных данных экранирование не требуется. Вот пример с двумя вложенными ключами с именами `author.data` и `name.surname`:

source: Note that escaping is still required when using multiple nested rules for configuration:
ru: Обратите внимание, что при использовании нескольких вложенных правил для конфигурации экранирование по-прежнему необходимо:

source: The example with the `Each` shortcut (`*`):
ru: Пример с сокращением `*`:

source: [Result]: result.md
ru: [Результаты]: result.md

source: [Basic usage]: #basic-usage-one-to-one-relation
ru: [Базовое использование]: #basic-usage-one-to-one-relation

source: [Configuring rules via PHP attributes]: configuring-rules-via-php-attributes.md
ru: [Настройка правил с помощью PHP атрибутов]: configuring-rules-via-php-attributes.md

source: [Using validator]: using-validator.md
ru: [Использование валидатора]: using-validator.md
