Repository: yiisoft/validator
Catalog: docs/po/using-validator.md/*/using-validator.md.*.po
Languages: ru

source: Rules
ru: Правила

source: Using validator
ru: Использование валидатора

source: Validator allows to check data in any format. Here are some of the most common use cases.
ru: Валидатор позволяет проверить данные в любом формате. Вот некоторые из наиболее распространенных случаев использования.

source: Data
ru: Данные

source: Single value
ru: Одиночное значение

source: In the simplest case, the validator can be used to check a single value:
ru: В простейшем случае, валидатор может использоваться для проверки одиночного значения:

source: > **Note:** Use [Each] rule to validate multiple values of the same type.
ru: > **Примечание:** Используйте правило [Each] для валидации нескольких значений одного типа.

source: Array
ru: Массив

source: It's possible to validate an array both as a whole and by individual items. For example:
ru: Валидировать массив можно как целиком, так и по отдельным элементам. Например:

source: use Yiisoft\Validator\Rule\FilledAtLeast; use Yiisoft\Validator\Rule\Count; use Yiisoft\Validator\Rule\Email; use Yiisoft\Validator\Rule\Length; use Yiisoft\Validator\Rule\Number; use Yiisoft\Validator\Rule\Required; use Yiisoft\Validator\Validator; $data = [ 'name' => 'John', 'age' => 17, 'email' => 'john@example.com', 'phone' => null, ]; $rules = [ // The rules that are not related to a specific property // At least one of the properties ("email" and "phone") must be passed and have non-empty value. new FilledAtLeast(['email', 'phone']), // The rules related to a specific property. 'name' => [ // The name is required (must be passed and have non-empty value). new Required(), // The name's length must be no less than 2 characters. new Length(min: 2), ], 'age' => new Number(min: 21), // The age must be at least 21 years. 'email' => new Email(), // Email must be a valid email address. ]; $result = (new Validator())->validate($data, $rules);
ru: use Yiisoft\Validator\Rule\FilledAtLeast; use Yiisoft\Validator\Rule\Count; use Yiisoft\Validator\Rule\Email; use Yiisoft\Validator\Rule\Length; use Yiisoft\Validator\Rule\Number; use Yiisoft\Validator\Rule\Required; use Yiisoft\Validator\Validator; $data = [ 'name' => 'John', 'age' => 17, 'email' => 'john@example.com', 'phone' => null, ]; $rules = [ // Правила, не относящиеся к конкретному свойству. // Хотя бы одно из свойств ("email" или "phone"), должно быть передано и иметь непустое значение. new FilledAtLeast(['email', 'phone']), // Правила, относящиеся к конкретному свойству. 'name' => [ // Свойство "name" обязательно (должно быть передано и иметь непустое значение). new Required(), // Длина "name" должна быть не менее 2 символов. new Length(min: 2), ], 'age' => new Number(min: 21), // Возраст должен быть не менее 21 года. 'email' => new Email(), // Email должен быть валидным адресом электронной почты. ]; $result = (new Validator())->validate($data, $rules);

source: > **Note:** Use [Nested] rule to validate nested arrays and [Each] rule to validate multiple arrays.
ru: > **Примечание:** Используйте правило [Nested] для валидации вложенных массивов и правило [Each] для валидации нескольких массивов.

source: Object
ru: Объект

source: Similar to arrays, it's possible to validate an object both as a whole and by individual properties.
ru: Подобно массивам, объект можно провалидировать как в целом, так и по отдельным свойствам.

source: For objects there is an additional option to configure validation with PHP attributes which allows to not pass the rules separately in explicit way (passing just the object itself is enough). For example:
ru: Для объектов есть дополнительная возможность настроить валидацию по атрибутами, что позволяет не передавать правила отдельно явным образом (достаточно передавать только сам объект). Например:

source: > **Note:** [readonly properties] are supported only starting from PHP 8.1.
ru: > **Примечание:** [readonly-свойства] поддерживаются только начиная с версии PHP 8.1.

source: > **Note:** Use [Nested] rule to validate related objects and [Each] rule to validate multiple objects.
ru: > **Примечание:** Используйте правило [Nested] для валидации связанных объектов и правило [Each] для валидации нескольких объектов.

source: Custom data set
ru: Пользовательский набор данных

source: Most of the time creating a custom data set is not needed because of built-in data sets and automatic normalization of all types during validation. However, this can be useful, for example, to change a default value for certain properties:
ru: В большинстве случаев создание собственного набора данных не требуется из-за наличия встроенных и автоматической нормализации всех типов во время валидации. Однако, это может оказаться полезным, например, для изменения значения по-умолчанию для определенных свойств:

source: Passing single rule
ru: Передача одиночного значения

source: For a single rule, there is an option to omit the array:
ru: Для одиночного правила есть возможность опустить массив:

source: Providing rules via dedicated object
ru: Передача правил посредством выделенного объекта

source: Could help reuse the same set of rules across different places. Two ways are possible - using PHP attributes and specifying explicitly via interface method implementation.
ru: Может помочь повторно использовать один и тот же набор правил в разных местах. Возможны два способа: использование атрибутов и явное указание через реализацию метода интерфейса.

source: Using PHP attributes
ru: Использование атрибутов

source: In this case, the rules will be automatically parsed, no need to additionally do anything.
ru: В этом случае правила будут парситься автоматически, дополнительно ничего делать не нужно.

source: Using interface method implementation
ru: Использование реализации метода интерфейса

source: Providing rules via interface method implementation has priority over PHP attributes. So, in case both are present, the attributes will be ignored without causing an exception.
ru: Передача правил через реализацию метода интерфейса имеет приоритет над атрибутами. Поэтому в случае одновременного использования, атрибуты будут игнорироваться без выбрасывания исключения.

source: use Yiisoft\Validator\Rule\Length; use Yiisoft\Validator\Rule\Number; use Yiisoft\Validator\RulesProviderInterface; use Yiisoft\Validator\Validator; final class PersonRulesProvider implements RulesProviderInterface { #[Length(min: 2)] // Will be silently ignored. public string $name; #[Number(min: 21)] // Will be silently ignored. protected int $age; public function getRules() : iterable { return ['name' => new Length(min: 2), 'age' => new Number(min: 21)]; } } $data = ['name' => 'John', 'age' => 18]; $rulesProvider = new PersonRulesProvider(); $result = (new Validator())->validate($data, $rulesProvider);
ru: use Yiisoft\Validator\Rule\Length; use Yiisoft\Validator\Rule\Number; use Yiisoft\Validator\RulesProviderInterface; use Yiisoft\Validator\Validator; final class PersonRulesProvider implements RulesProviderInterface { #[Length(min: 2)] // Будет тихо проигнорировано. public string $name; #[Number(min: 21)] // Будет тихо проигнорировано. protected int $age; public function getRules() : iterable { return ['name' => new Length(min: 2), 'age' => new Number(min: 21)]; } } $data = ['name' => 'John', 'age' => 18]; $rulesProvider = new PersonRulesProvider(); $result = (new Validator())->validate($data, $rulesProvider);

source: Providing rules via the data object
ru: Передача правил через объект данных

source: In this way, rules are provided in addition to data in the same object. Only interface method implementation is supported. Note that the `rules` argument is `null` in the `validate()` method call.
ru: В этом случае правила передаются в дополнение к данным в одном и том же объекте. Поддерживается только реализация метода интерфейса. Обратите внимание, что аргумент `rules` имеет значение `null` при вызове метода `validate()`.

source: use Yiisoft\Validator\Rule\Length; use Yiisoft\Validator\Rule\Number; use Yiisoft\Validator\RulesProviderInterface; use Yiisoft\Validator\Validator; final class Person implements RulesProviderInterface { #[Length(min: 2)] // Not supported for using with data objects. Will be silently ignored. public string $name; #[Number(min: 21)] // Not supported for using with data objects. Will be silently ignored. protected int $age; public function getRules(): iterable { return ['name' => new Length(min: 2), 'age' => new Number(min: 21)]; } } $data = new Person(name: 'John', age: 18); $result = (new Validator())->validate($data);
ru: use Yiisoft\Validator\Rule\Length; use Yiisoft\Validator\Rule\Number; use Yiisoft\Validator\RulesProviderInterface; use Yiisoft\Validator\Validator; final class Person implements RulesProviderInterface { #[Length(min: 2)] // Не поддерживается для использования с объектами данных. Будет тихо проигнорировано. public string $name; #[Number(min: 21)] // Не поддерживается для использования с объектами данных. Будет тихо проигнорировано. protected int $age; public function getRules(): iterable { return ['name' => new Length(min: 2), 'age' => new Number(min: 21)]; } } $data = new Person(name: 'John', age: 18); $result = (new Validator())->validate($data);

source: [readonly properties]: https://www.php.net/manual/en/language.oop5.properties.php#language.oop5.properties.readonly-properties
ru: [readonly-свойства]: https://www.php.net/manual/ru/language.oop5.properties.php#language.oop5.properties.readonly-properties
