Repository: yiisoft/validator
Catalog: docs/po/result.md/*/result.md.*.po
Languages: ru

source: Result
ru: Результат

source: The validation result is an object containing of errors occurred during validation.
ru: Результатом валидации является объект, содержащий ошибки, возникшие во время проверки.

source: Is validation successful?
ru: Валидация успешна?

source: To just check the status of validation (whether a data is valid as a whole), use the following `Result` API call:
ru: Чтобы просто проверить статус валидации (валидны ли данные в целом), используйте следующий API-вызов `Result`:

source: It can be narrowed down to a specific property:
ru: Его можно сузить до определенного свойства:

source: Errors
ru: Ошибки

source: Most of the time telling only the status of validation is not enough. There are multiple methods to get detailed errors list with their data from the result. The difference between them is in the grouping, filtering, and representation of every error. Choose one to fit your needs depending on the situation.
ru: В большинстве случаев недостаточно указать только статус валидации. Существует несколько способов получить подробный список ошибок с данными о них из результата. Разница между ними заключается в группировке, фильтрации и представлении каждой ошибки. В зависимости от ситуации выбирайте тот, который соответствует вашим потребностям.

source: Flat list of error messages
ru: Плоский список сообщений об ошибках

source: One of the simplest cases is getting a flat list of all error messages. Use the following `Result` API call:
ru: Одним из самых простых случаев является получение плоского списка всех сообщений об ошибках. Для этого используйте следующий API-вызов `Result`:

source: An example of output with `age` and `email` properties:
ru: Пример вывода со свойствами `age` и `email`:

source: It's easy to display and iterate, however, with a bigger amount of properties and depending on a message, it can be problematic to understand which property an error belongs to.
ru: Его легко показывать и перебирать, однако при большом количестве свойств и в зависимости от сообщения, может быть проблематично понять, к какому свойству относится ошибка.

source: Error messages not bound to a specific property
ru: Сообщения об ошибках, не привязанные к определенному свойству

source: Sometimes error messages are not related to a specific property. It can happen during the validation of multiple properties depending on each other for example. Use the following `Result` API call:
ru: Иногда сообщения об ошибках не связаны с конкретным свойством. Это может случиться, например, во время валидации нескольких свойств, зависящих друг от друга. В таком случае используйте следующий API-вызов `Result`:

source: The output for example above:
ru: Результат для примера выше:

source: Filtering by a specific property
ru: Фильтрация по определенному свойству

source: This list can be also filtered by a specific property. Only top-level attributes are supported.
ru: Список также может быть отфильтрован по конкретному свойству. Поддерживаются свойства только верхнего уровня.

source: Error messages indexed by property
ru: Сообщения об ошибках, сгруппированные по свойству

source: To group error messages by property, use the following `Result` API call:
ru: Для группировки сообщений об ошибках по свойству, используйте следующий API-вызов `Result`:

source: An example of output:
ru: Пример результата:

source: [ 'name' => [ 'Value cannot be blank.', 'This value must contain at least 4 characters.', ], 'email' => ['This value is not a valid email address.'], // Error messages not bound to specific property are grouped under empty string key. '' => ['A custom error message.'], ];
ru: [ 'name' => [ 'Value cannot be blank.', 'This value must contain at least 4 characters.', ], 'email' => ['This value is not a valid email address.'], // Сообщения об ошибках, не привязанные к конкретному свойству, группируются в ключе со значением пустая строка. '' => ['A custom error message.'], ];

source: Note that the result is always a 2-dimensional array with property names as keys at the first nesting level. This means that further nesting of properties is not supported (but could be achieved by using [`getErrorMessagesIndexedByPath()`](#error-messages-indexed-by-path)). Returning to the previous example, when `name` and `email` belong to a `user` property, the output will be:
ru: Обратите внимание, что результатом всегда является двумерный массив с именами свойств в качестве ключей на первом уровне вложенности. Это означает, что дальнейшее вложение свойств не поддерживается (но может быть достигнуто с помощью [`getErrorMessagesIndexedByPath()`](#сообщения-об-ошибках-сгруппированные-по-пути)). Возвращаясь к предыдущему примеру, когда `name` и `email` принадлежат свойству `user`, выходные данные будут такими:

source: [ 'user' => [ 'Value cannot be blank.', 'This value must contain at least 4 characters.', 'This value is not a valid email address.' ], // Error messages not bound to specific property are grouped under empty string key. '' => ['A custom error message.'], ];
ru: [ 'user' => [ 'Value cannot be blank.', 'This value must contain at least 4 characters.', 'This value is not a valid email address.' ], // Сообщения об ошибках, не привязанные к конкретному свойству, группируются в ключе со значением пустая строка. '' => ['A custom error message.'], ];

source: Also keep in mind that property names must be strings, even when used with `Each`:
ru: Также имейте в виду, что имена свойств всегда являются строками, даже если они используются с `Each`:

source: With input containing non-string keys for top level properties, for example, `[21, 22, 23, 20]`, `InvalidArgumentException` will be thrown.
ru: Если входные данные содержат нестроковые ключи для свойств верхнего уровня, например, `[21, 22, 23, 20]`, будет выброшено исключение `InvalidArgumentException`.

source: Even array `['1' => 21, '2' => 22, '3' => 23, '4' => 20]` will cause an error, because PHP [will cast keys to the int type].
ru: Даже массив `['1' => 21, '2' => 22, '3' => 23, '4' => 20]` вызовет ошибку, поскольку PHP [приведет ключи к типу int].

source: But if given array with string keys `['1a' => 21, '2b' => 22, '3c' => 23, '4d' => 20]`, the output will be:
ru: Но если задан массив со строковыми ключами `['1a' => 21, '2b' => 22, '3c' => 23, '4d' => 20]`, вывод будет следующим:

source: Error messages indexed by path
ru: Сообщения об ошибках, сгруппированные по пути

source: This is probably the most advanced representation offered by built-in methods. The grouping is done by path - a concatenated property sequence showing the location of errored value within a data structure. A separator is customizable, dot notation is set as the default one. Use the following `Result` API call:
ru: Вероятно, это самое продвинутое представление, предлагаемое встроенными методами. Группировка осуществляется по пути - объединенной последовательности свойств, показывающей расположение ошибочного значения в структуре данных. Разделитель настраивается, точечная нотация используется по умолчанию. Используйте следующий API-вызов `Result`:

source: [ 'user.firstName' => ['Value cannot be blank.'], 'user.lastName' => ['This value must contain at least 4 characters.'], 'email' => ['This value is not a valid email address.'], // Error messages not bound to specific property are grouped under empty string key. '' => ['A custom error message.'], ];
ru: [ 'user.firstName' => ['Value cannot be blank.'], 'user.lastName' => ['This value must contain at least 4 characters.'], 'email' => ['This value is not a valid email address.'], // Сообщения об ошибках, не привязанные к конкретному свойству, группируются в ключе со значением пустая строка. '' => ['A custom error message.'], ];

source: A path can contain integer elements too (when using the `Each` rule for example):
ru: Путь также может содержать целочисленные элементы (например, при использовании правила `Each`)

source: Resolving special characters collision in property names
ru: Разрешение конфликтов специальных символов в именах свойств

source: When the property name in the error messages list contains a path separator (dot `.` by default), it is automatically escaped using a backslash (`\`):
ru: Если имя свойства в списке сообщений об ошибках содержит разделитель пути (по умолчанию точка `.`) он автоматически экранируется обратной косой чертой (`\`):

source: In case of using a single property per rule set, any additional modifications of attribute names in the rules configuration are not required, so they must stay as is:
ru: В случае использования одного свойства в наборе правил любые дополнительные изменения имен свойств в правилах конфигурации не требуются, поэтому они должны оставаться такими, какие есть:

source: However, when using the `Nested` rule with multiple properties per rule set, special characters need to be escaped with a backslash (`\`) for value paths to be correct and to be possible to reverse them back from string to individual items. See the [Using keys containing separator / shortcut] section for more details.
ru: Однако, при использовании правила `Nested` с несколькими свойствами в каждом наборе правил, специальные символы необходимо экранировать с помощью обратной косой черты (`\`) для того, чтобы пути к значениям были корректными и можно было преобразовать их обратно из строки в индивидуальные значения. Подробности смотрите в разделе [Использование ключей, содержащих разделитель / сокращение].

source: This can be used as an alternative to using a custom separator.
ru: Это можно использовать как альтернативу использования пользовательского разделителя.

source: This list can be also filtered by a specific property. Only top-level properties are supported.
ru: Список также может быть отфильтрован по конкретному свойству. Поддерживаются атрибуты только верхнего уровня.

source: Error objects list
ru: Список объектов ошибок

source: When even these representations are not enough, an initial unmodified list of error objects can be accessed via this method:
ru: Когда даже этих представлений недостаточно, доступ к исходному немодифицированному списку объектов ошибок можно получить через этот метод:

source: Each error stores the following data:
ru: Для каждой ошибки сохраняются следующие данные:

source: Message. Either a simple message like `This value is wrong.` or a template with placeholders enclosed in curly braces (`{}`), for example: `Value must be no less than {min}.`. The actual formatting is done in `Validator` depending on the configured translator.
ru: - Сообщение. Любое простое сообщение типа `This value is wrong.` или шаблон с плейсхолдерами, заключенными в фигурные скобки, например: `Value must be no less than {min}.`. Фактическое форматирование выполняется в `Validator` в зависимости от настроек.

source: Template parameters for substitution during formatting, for example: `['min' => 7]`.
ru: Параметры шаблона для подстановки при форматировании, например: `['min' => 7]`.

source: A path to a value within a checked data structure, for example: `['user', 'name', 'firstName']`.
ru: Путь к значению в проверяемой структуре данных, например: `['user', 'name', 'firstName']`.

source: An example of an application
ru: Пример приложения

source: What this can be useful for? For example, to build a nested tree of error messages indexed by property names:
ru: Чем это может быть полезно? Например, чтобы построить вложенное дерево сообщений об ошибках, сгруппированное по именам свойств:

source: It's intentionally not provided out of the box due to the complexity of iteration. However, this can be useful for dumping as JSON and storing in logs for example.
ru: Это намеренно не предусмотрено из коробки из-за сложности итерации. Однако может быть полезно, например, для дампа JSON или сохранения в лог.

source: Debugging original error objects is also more convenient.
ru: Отладка исходных объектов ошибок также становится более удобной.

source: [Using keys containing separator / shortcut]: built-in-rules-nested.md#using-keys-containing-separator--shortcut
ru: [Использование ключей, содержащих разделитель / сокращение]: built-in-rules-nested.md#using-keys-containing-separator--shortcut

source: [will cast keys to the int type]: https://www.php.net/manual/en/language.types.array.php
ru: [приведет ключи к типу int]: https://www.php.net/manual/ru/language.types.array.php
